[
  {
    "name": "oneLiners",
    "aliases": ["1l", "ol", "one"],
    "jokes": [
      "6:30 is the best time on a clock, hands down.",
      "A blind man walked into a bar… and a table… and a chair…",
      "A book fell on my head the other day. I only have my shelf to blame though.",
      "A dung beetle walks into a bar and asks, ‘Is this stool taken?’",
      "A Freudian slip is when you mean one thing and mean your mother.",
      "A ghost walked into a bar and ordered a shot of vodka. The bartender said, ‘Sorry, we don’t serve spirits here.’",
      "A Mexican magician tells the audience he will disappear on the count of three. He says, ‘Uno, dos…” and poof! He disappeared without a tres.",
      "A recent study has found that women who carry a little extra weight live longer than the men who mention it.",
      "A termite walks into the bar and asks, ‘Is the bar tender here?’",
      "A told my girlfriend she drew her eyebrows too high. She seemed surprised.",
      "Adam & Eve were the first ones to ignore the Apple terms and conditions.",
      "Always borrow money from a pessimist. They’ll never expect it back.",
      "Are people born with photographic memories, or does it take time to develop?",
      "Atheism is a non-prophet organization.",
      "Before you criticize someone, walk a mile in their shoes. That way, when you do criticize them, you’re a mile away and you have their shoes.",
      "Blunt pencils are really pointless.",
      "Build a man a fire and he’ll be warm for a day. Set a man on fire and he’ll be warm for the rest of his life.",
      "Communist jokes aren’t funny unless everyone gets them.",
      "Despite the high cost of living, it remains popular.",
      "Did you hear about the guy whose whole left side got amputated? He’s all right now.",
      "Don’t you hate it when someone answers their own questions? I do.",
      "Fighting for peace is like screwing for virginity.",
      "Four fonts walk into a bar. The bartender says, ‘Hey! We don’t want your type in here!’",
      "Geology rocks, but geography’s where it’s at.",
      "Have you heard about the new restaurant called ‘Karma?’ There’s no menu—you get what you deserve.",
      "How do you make holy water? You boil the hell out of it.",
      "I always take life with a grain of salt. And a slice of lemon. And a shot of tequila.",
      "I bought the world’s worst thesaurus yesterday. Not only is it terrible, it’s also terrible.",
      "I buy all my guns from a guy called T-Rex. He’s a small arms dealer.",
      "I can tell when people are being judgmental just by looking at them.",
      "I can’t believe I got fired from the calendar factory. All I did was take a day off.",
      "I didn’t think orthopedic shoes would help, but I stand corrected.",
      "I don’t suffer from insanity—I enjoy every minute of it.",
      "I failed math so many times at school, I can’t even count.",
      "I got a new pair of gloves today, but they’re both ‘lefts,’ which on the one hand is great, but on the other, it’s just not right.",
      "I have a few jokes about unemployed people, but none of them work.",
      "I heard there were a bunch of break-ins over at the car park. That is wrong on so many levels.",
      "I just got kicked out of a secret cooking society. I spilled the beans.",
      "I know they say that money talks, but all mine says is ‘Goodbye.’",
      "I put my grandma on speed dial the other day. I call it insta-gram.",
      "I saw a sign the other day that said, ‘Watch for children,’ and I thought, ‘That sounds like a fair trade.’",
      "I threw a boomerang a couple years ago; I know live in constant fear.",
      "I told him to be himself; that was pretty mean, I guess.",
      "I used to have a handle on life, but then it broke.",
      "I used to think I was indecisive. But now I’m not so sure.",
      "I want to die peacefully in my sleep, like my grandfather… Not screaming and yelling like the passengers in his car.",
      "I was addicted to the hokey pokey, but then I turned myself around.",
      "I was riding a donkey the other day when someone threw a rock at me and I fell off. I guess I was stoned off my ass.",
      "I was wondering why the frisbee kept getting bigger and bigger, but then it hit me.",
      "I went to a seafood disco last week, but ended up pulling a mussel.",
      "I went to buy some camo pants but couldn’t find any.",
      "If a parsley farmer gets sued, can they garnish his wages?",
      "If attacked by a mob of clowns, go for the juggler.",
      "If you don’t pay your exorcist, do you get repossessed?",
      "It takes a lot of balls to golf the way I do.",
      "It was an emotional wedding. Even the cake was in tiers.",
      "I’m reading a book about anti-gravity. It’s impossible to put down.",
      "Just burned 2,000 calories. That’s the last time I leave brownies in the oven while I nap.",
      "Just got fired from my job as a set designer. I left without making a scene.",
      "Last night my girlfriend was complaining that I never listen to her… or something like that.",
      "Light travels faster than sound, which is the reason that some people appear bright before you hear them speak.",
      "Maybe if we start telling people their brain is an app, they’ll want to use it.",
      "Most people are shocked when they find out how bad I am as an electrician.",
      "My father has schizophrenia, but he’s good people.",
      "My friend was explaining electricity to me, but I was like, ‘Watt?’",
      "My friend’s bakery burned down last night. Now his business is toast.",
      "My teachers told me I’d never amount to much because I procrastinate so much. I told them, “Just you wait!”",
      "My therapist says I have a preoccupation for revenge. We’ll see about that.",
      "My wife just found out I replaced our bed with a trampoline. She hit the ceiling!",
      "My wife told me to stop impersonating a flamingo. I had to put my foot down.",
      "Never trust atoms; they make up everything.",
      "One of the cows didn’t produce milk today. It was an udder failure.",
      "People who take care of chickens are literally chicken tenders.",
      "People who use selfie sticks really need to have a good, long look at themselves.",
      "Pollen is what happens when flowers can’t keep it in their plants.",
      "Refusing to go to the gym is a form of resistance training.",
      "Russian dolls are so full of themselves.",
      "The easiest time to add insult to injury is when you’re signing someone’s cast.",
      "The first time I got a universal remote control, I thought to myself, ‘This changes everything.’",
      "The future, the present, and the past walk into a bar. Things got a little tense.",
      "The last thing I want to do is hurt you; but it’s still on the list.",
      "The man who invented knock-knock jokes should get a no bell prize.",
      "The man who invented Velcro has died. RIP.",
      "The man who survived both mustard gas and pepper spray is a seasoned veteran now.",
      "The problem isn’t that obesity runs in your family. It’s that no one runs in your family.",
      "The problem with kleptomaniacs is that they always take things literally.",
      "The rotation of Earth really makes my day.",
      "The world champion tongue twister got arrested. I hear they’re going to give him a tough sentence.",
      "Today a man knocked on my door and asked for a small donation toward the local swimming pool. I gave him a glass of water.",
      "Two fish are in a tank. One says, ‘How do you drive this thing?’",
      "Two wifi engineers got married. The reception was fantastic.",
      "Well, to be Frank with you, I’d have to change my name.",
      "What if there were no hypothetical questions?",
      "What’s a frog’s favorite type of shoes? Open toad sandals.",
      "What’s the difference between ignorance and apathy? I don’t know and I don’t care.",
      "When life gives you melons, you might be dyslexic.",
      "When the cannibal showed up late to the buffet, they gave him the cold shoulder.",
      "Whiteboards are remarkable.",
      "Will glass coffins be a success? Remains to be seen.",
      "‘Doctor, there’s a patient on line one that says he’s invisible.’ ‘Well, tell him I can’t see him right now.’",
      "‘I have a split personality,’ said Tom, being Frank."
    ]
  },
  {
    "name": "knockKnock",
    "aliases": ["kk", "knock-knock"],
    "jokes": [
      ["A herd", "A herd you were home, so here I am!"],
      ["Abbot", "Abbot you don’t know who this is!"],
      ["Abby", "Abby birthday to you!"],
      ["Adore", "Adore is between us, so open it!"],
      ["Al", "Al give you a hug if you open this door!"],
      ["Alec", "Alectricity. BUZZ!"],
      ["Alex", "Alex-plain later!"],
      ["Alice", "Alice fair in love and war."],
      ["Alien", "Um, how many aliens do you know?"],
      ["Althea", "Althea later alligator!"],
      ["Amanda", "A man da fix your door!"],
      ["Amos", "A mosquito. Look, right there!"],
      ["Anita", "Let me in! Anita borrow something."],
      ["Annie", "Annie thing you can do, I can do too!"],
      ["Arfur", "Arfur got!"],
      ["Avenue", "Avenue knocked on this door before?"],
      ["Ben", "Ben knocking for 10 minutes!"],
      ["Boo", "Don’t cry, it’s just a joke."],
      ["Candice", "Candice egg be eaten?"],
      ["Canoe", "Canoe help me get inside?"],
      ["Cash", "Nah, I’m more into almonds."],
      ["Claire", "Claire a path, I’m coming through!"],
      ["Cow says", "No, a cow says mooooo!"],
      ["Cows go", "Cows don’t go who, they go moo!"],
      ["Dishes", "Dishes a nice place!"],
      ["Dozen", "Dozen anybody want to let me in?"],
      ["Dwayne", "Dwayne the sink. I need to use it!"],
      ["Dwayne", "Dwayne the tub, I’m dwowning"],
      ["Etch", "Bless you!"],
      ["Euripides", "Euripides clothes, you pay for them!"],
      ["Europe", "I am NOT a poo!"],
      ["Figs", "Figs the doorbell, it’s not working!"],
      ["Hal", "Hal will you know if you don’t open the door?"],
      ["Harry", "Harry up, it’s cold outside!"],
      ["Hawaii", "I’m good. Hawaii you?"],
      ["Ice cream", "Ice cream your name if you want me to!"],
      ["Icy", "Icy you looking at me!"],
      ["Imma", "Imma getting older waiting for you to open up!"],
      ["Iran", "Iran here. I’m tired!"],
      ["Isabel", "Isabel working?"],
      ["Justin", "Justin time for dinner."],
      ["Ketchup", "Ketchup with me and I’ll tell you!"],
      ["Leaf", "Leaf me alone!"],
      ["Lettuce", "Lettuce in, it’s cold out here!"],
      ["Luke", "Luke through the peep hole and find out."],
      ["Mustache", "I mustache you a question."],
      ["Needle", "Needle little money please."],
      ["Noah", "Noah good place we can go hang out?"],
      ["Nobel", "Nobel... that’s why I knocked!"],
      ["Norma Lee", "Norma Lee I don’t knock on random doors, but I had to meet you!"],
      ["Orange", "Orange you going to let me in?"],
      ["Razor", "Razor hands, this is a stick up!"],
      ["Roach", "Roach you a letter. Did you get it?"],
      ["Robin", "Robin you, now hand over the cash!"],
      ["Sadie", "Sadie magic word and I’ll come in!"],
      ["Scold", "Scold enough out here to go ice skating!"],
      ["Snow", "Snow use. The joke is over."],
      ["Spell", "W. H. O."],
      ["Stopwatch", "Stopwatch you’re doing and let me in!"],
      ["Tank", "You’re welcome"],
      ["Theodore", "Theodore is stuck. Open up!"],
      ["To", "Actually, it’s to whom."],
      ["Viper", "Viper nose, it’s running!"],
      ["Watson", "Watson TV right now?"],
      ["Who", "I didn’t know you were an owl!"],
      ["Woo", "Glad you’re excited, too!"]
    ]
  },
  {
    "name": "twoLiners",
    "aliases": ["2l", "tl", "two"],
    "jokes": [
      ["Have you heard about the corduroy pillow?", "It’s making headlines!"],
      ["How can you tell it’s a dogwood tree?", "By the bark."],
      ["How did the barber win the race?", "He knew a shortcut"],
      ["How did the hipster burn his tongue?", "He drank his coffee before it was cool"],
      ["How do you impress a baker?", "Bring him flours"],
      ["How do you stop a bull from charging?", "Cancel its credit card"],
      ["How do you tell if a vampire is sick?", "See if he is coffin"],
      ["How does a duck buy lipstick?", "She just puts it on her bill"],
      ["How does a rancher keep track of his cattle?", "With a cow-culator"],
      ["If athletes get athlete’s foot, what do elves get?", "Mistle-toes"],
      ["What did one hat say to the other?", "You stay here. I’ll go on ahead"],
      ["What did the cake say to the fork?", "You want a piece of me?"],
      ["What did the elevator say when it sneezed?", "I think I’m coming down with something"],
      ["What did the football coach say to the broken vending machine?", "Give me my quarterback"],
      ["What did the ocean say to the shore?", "Nothing. It waved"],
      ["What did the policeman say to his belly button?", "You’re under a vest"],
      ["What did the tomato say to the other tomato during a race?", "Ketchup."],
      ["What do horses say when they fall?", "I can’t giddy up"],
      ["What do lawyers wear to work?", "Lawsuits"],
      ["What do sea monsters eat?", "Fish and ships"],
      ["What do sprinters eat before they race?", "Nothing. They fast"],
      ["What do you call a bear with no teeth?", "A gummy bear"],
      ["What do you call a criminal going down the stairs?", "A con descending"],
      ["What do you call a fish without eyes?", "Fsh"],
      ["What do you call a man that irons clothes?", "Iron Man"],
      ["What do you call a priest that becomes a lawyer?", "A father-in-law"],
      ["What do you call a row of rabbits hopping away?", "A receding hare line"],
      ["What do you call a sleeping bull?", "A bulldozer"],
      ["What do you call an alligator detective?", "An investi-gator"],
      ["What do you call banana peel shoes?", "Slippers"],
      ["What do you call fake spaghetti?", "An im-pasta"],
      ["What do you do with a sick boat?", "Take it to the doc"],
      ["What does corn say when it gets a compliment?", "Aw shucks!"],
      ["What has more lives than a cat?", "A frog, because it croaks every day"],
      ["What kind of ghost has the best hearing?", "The eeriest"],
      ["What kind of music do mummies listen to?", "Wrap music."],
      ["What kind of shoes do robbers wear?", "Sneakers"],
      ["What kind of tea is hard to swallow?", "Reality"],
      ["What lights up a soccer stadium?", "A soccer match"],
      ["What was the frog’s job at the hotel?", "Bellhop"],
      ["What’s brown and sticky?", "A stick"],
      ["What’s that restaurant on the moon like?", "It doesn’t have atmosphere"],
      ["What’s the best way to burn 1,000 calories?", "Leave the pizza in the oven"],
      ["What’s the difference between a poorly dressed man on a tricycle and a well-dressed man on a bicycle?", "Attire"],
      ["What’s the difference between the bird flu and the swine flu?", "One requires tweetment and the other an oinkment"],
      ["When do computers overheat?", "When they need to vent"],
      ["When is a door not a door?", "When it’s ajar"],
      ["Where does the electric cord go to shop?", "An outlet mall"],
      ["Which flowers are the best kissers?", "Tu-lips"],
      ["Why are elephants wrinkly?", "Because you can’t iron them"],
      ["Why are frogs are so happy?", "They eat whatever bugs them"],
      ["Why are there gates around cemeteries?", "Because people are dying to get in"],
      ["Why can’t you trust duck doctors?", "They’re all quacks"],
      ["Why can’t you trust the king of the jungle?", "Because he’s always lion"],
      ["Why can’t your ear be 12 inches long?", "Because then it would be a foot"],
      ["Why couldn’t the pirate learn the alphabet?", "Because he got lost at C"],
      ["Why did the bike fall over?", "It was two tired"],
      ["Why did the Clydesdale give the pony a glass of water?", "Because he was a little horse"],
      ["Why did the farmer win an award?", "He was outstanding in his field"],
      ["Why did the golfer bring two pairs of pants?", "In case he got a hole in one"],
      ["Why did the invisible man turn down the job offer?", "He couldn’t see himself doing it"],
      ["Why did the kid stock up on yeast?", "He wanted to make some dough"],
      ["Why did the man get hit by a bike every day?", "He was stuck in a vicious cycle"],
      ["Why did the mushroom go to the party?", "Because he was a fungi"],
      ["Why did the photo go to jail?", "Because it was framed"],
      ["Why did the robber jump in the shower?", "He wanted to make a clean getaway"],
      ["Why did the robber jump in the tub?", "He wanted to make a clean getaway"],
      ["Why did the scarecrow win an award?", "Because he was outstanding in his field"],
      ["Why did the stadium get hot after the game?", "All of the fans left"],
      ["Why do bees have sticky hair?", "Because they use honeycombs"],
      ["Why do people say “break a leg” when you go on stage?", "Because every play has a cast"],
      ["Why do seagulls fly over the sea?", "If they flew over the bay, they would be bagels"],
      ["Why does a chicken coop only have two doors?", "If it had four doors it would be called a chicken sedan"],
      ["Why does Snoop Dogg use an umbrella?", "For drizzle!"],
      ["Why don’t eggs tell jokes?", "They crack up too easily"],
      ["Why don’t melons get married?", "Because they cantaloupe"],
      ["Why don’t they play poker in the jungle?", "Too many cheetahs"],
      ["Why don’t you buy things with Velcro?", "It’s a rip-off"],
      ["Why shouldn’t you write with a broken pen?", "Because it’s pointless"],
      ["Why were the fish’s grades bad?", "They were below sea level"],
      ["Why wouldn’t the poppy seed leave the casino?", "He was on a roll"],
      ["Why wouldn’t the shrimp share his snack?", "He was shellfish"]
    ]
  }
]
