[
  {
    "name": "MadamBeespit",
    "aliases": ["madam", "beespit", "bee", "spit"],
    "quotes": [
      "I collect heads, and the hearts of my enemies",
      "I'm always most happy when stabby",
      "I couldn't resist the pornos. It's my weakness",
      "If I could send you someone's head for a present I would"
    ]
  },
  {
    "name": "Cony_Cage",
    "aliases": ["cony", "conys", "cage"],
    "title": "Cony's Wisdom",
    "quotes": [
      "There once was a young man named Dave,\nwho kept a dead whore in a cave.\nHe said, \"I have to admit,\nshe smells just like shit,\nbut think of the money I’ll save!\"",
      "Nymphomaniacal Jill,\nTried dynamite sticks for a thrill,\nThey found her vagina in North Carolina,\nAnd bits of her tits in Brazil.",
      "There was a young suitor from Kent,\nWhose dick was so long that it bent,\nTo give the girls trouble, he folded it double,\nAnd then when he came, he went.",
      "There once was a vampire, Mabel\nWith periods exceedingly stable\nSo every full moon\nShe would get out a spoon\nAnd drink herself under the table.",
      "I used to breed rabbits, but then I realized they can handle it themselves.",
      "I went to see the doctor about my short-term memory problems. The first thing the bastard did was make me pay in advance.",
      "Women usually claim childbirth is the most painful experience of their lives. Until they start stepping on Legos approximately three years later.",
      "I ran into my ex in town yesterday. Then I ran over her and backed up to run into her again.",
      "To date, 4 Popes have died during sexual intercourse.",
      "Elephants have a prehensile penis.\nThat means they can use it to grab stuff.",
      "A sweet little bird on my window sill\nBig blue eyes, pretty little bill.\nFirst I feed the bird some bread\nThen I crushed his fucking head.",
      "Orangutangs make dildos out of wood.",
      "In much the same way everyone has their own fingerprints and retinal patterns, every anus is unique.",
      "In ancient Egypt when a beautiful woman died they would let her corpse rot for 3 days in the sun before sending the body to the embalmer. This was to discourage necrophilia.",
      "The composition of the inside of your cheek is identical to the composition of a vagina.",
      "Female kangaroos have three vaginas.\nThey also have two uteruses and a pouch, which means they can be perpetually pregnant.",
      "Women are 33% more likely to search for \"clowns\" than men.\n2019 PornHub user insights.",
      "Doctors can grow skin for burn victims using the foreskins of circumcised infants.One foreskin can produce 250,000 square feet of skin, enough to cover 6 American football stadiums!",
      "Want to come over and watch porn on my flat screen mirror?",
      "Cock size is passed down via the X chromosome, meaning a guy's dick won't have any resemblance to his dad's dick."
    ]
  },
  {
    "name": "LordofFire",
    "aliases": ["lord", "lordo", "lof", "fire"],
    "quotes": [
      "Don't be a bitch, make yourself rich!",
      "Empty your attic, his trades are fantastic!",
      "Don't be a dummy, he will give you good money!",
      "Just the right sales force to pay for your divorce!",
      "Empty your cellar and see the bank teller!",
      "Empty your pocket, cash will sky-rocket!",
      "Stop trading willy-nilly! LordofFire - everyone else would be silly!",
      "The highest prices, on all devices!",
      "He is the most suited, other traders are stupid!",
      "Sell him your stuff, he can't get enough!",
      "Don't throw a fit and sell all your shit!",
      "Which trader do we admire? It is LordofFire!",
      "Sell all your junk to this gorgeous hunk!",
      "A trade with LordofFire fills everyones desire!"
    ]
  },
  {
    "name": "Keetla",
    "aliases": ["keet"],
    "quotes": [
      "RIGGED!",
      "Somehow, in my faction, I get heat for my \"vibe\"",
      "I think i was kicked out of poker chat... Do extreem left people hold power in Torn?",
      "What do we get in return, a war win? A plot of land? NOTHING???? but a maybe they might help us if they feel like it???\nIf we don't get anything but a maybe, this is a ***** bad idea!",
      "I just got blocked at rex's. no idea why"
    ]
  },
  {
    "name": "Nautilus-",
    "aliases": ["naut", "nauti"],
    "quotes": [
      "^-^",
      ">_>",
      "<_<",
      "XD",
      "-.-",
      "O.O",
      "8c",
      "c8",
      "I’m a dirty girl.... BUT I AM CERTAINLY NOT A SLUT",
      "Do you ever get the feeling in your asshole when you drink?????"
    ]
  },
  {
    "name": "Zymurgist",
    "aliases": ["zym", "murg"],
    "quotes": [
      "I was voted \"most likely to be forgotten\" in high school."
    ]
  },
  {
    "name": "Grandmodesty",
    "aliases": ["grand", "modest"],
    "quotes": [
      "OH LOOK STILL NO BOT FOR ME"
    ]
  },
  {
    "name": "Floofist",
    "aliases": ["floo", "floof", "fist"],
    "quotes": [
      "I consider anyone born before 92 a boomer"
    ]
  },
  {
    "name": "Metallistar",
    "aliases": ["metal"],
    "images": [
      "https://media.tenor.com/images/f91469bca847613dd3b6211fd32d0b3e/tenor.gif",
      "https://i.imgflip.com/11w8vz.jpg",
      "https://vignette.wikia.nocookie.net/spongebob/images/e/ed/113a_-_Krusty_Krushers_%28590%29.jpg",
      "https://4.bp.blogspot.com/-fo1KIpbRu6g/UMYRODrwViI/AAAAAAAABOw/WRZX7OJYDdQ/s1600/DSC02290.JPG",
      "https://media3.giphy.com/media/PDsgxQoXvUZGg/giphy.gif?cid=ecf05e4787a06f191f462763b79f6e9772aa291d768460cc&rid=giphy.gif"
    ]
  },
  {
    "name": "PommesMitMayo",
    "aliases": ["pmm", "pom", "pommes"],
    "quotes": [
      "discount eDVDs!!",
      "discount DBKs!!",
      "discount DPs!!",
      "discount plushies!!",
      "discount cans!!",
      "i really really love the :pirate_flag: system",
      "DPs are too much for you,\ndollars in your wallet few,\nbuying weapons too expensive,\nyour bank account looks apprehensive,\ndebt is building up with Duke,\nthe shack you live in makes you puke,\nno items left to trade with Lord,\nyour loan requests all get ignored,\nFloofist wins another lotto,\nwhile you slut yourself for low dough,\ngetting buy mugged all the time,\nsearch the dump for every dime,\ndidnt pay your rent for weeks,\nyour seven month old armor reeks,\nwhen LinFeng mugs another prey,\nand Conys clowns ruin your day,\nwhen Zym sends you to hospital,\nand Madams bloodlust turns you brittle,\neveryone around you rich,\nyour measely networth makes you twitch,\nthen maybe you will understand:\nThe dark side is your biggest friend."
    ],
    "images": [
      "https://media1.tenor.com/images/f3c17c5ab1efca8e1cce4b8b6dd88228/tenor.gif"
    ]
  }
]
